Repository: Waynelee2001/Compositor
Catalog: Compositor/AI/Codex.xcstrings
Source language: en
Languages: zh_hans

source: Stopping
zh_hans: 正在停止

source: Awaiting approval
zh_hans: 等待确认

source: Working
zh_hans: 处理中

source: Connecting
zh_hans: 正在连接

source: Connected
zh_hans: 已连接

source: Disconnected
zh_hans: 未连接

source: Describe the photo edit…
zh_hans: 描述你想怎样修这张照片…

source: Share the canvas with the model?
zh_hans: 允许模型查看画布吗？

source: Cancel
zh_hans: 取消

source: Allow canvas sharing
zh_hans: 允许共享画布

source: Codex may send a 1024px preview of this document to the signed-in model provider. Original image metadata and the .comp package are not attached. Turn this off at any time.
zh_hans: Codex 可以将此文档的最长边不超过 1024 像素的预览发送给已登录的模型服务。不会附带原图元数据或 .comp 工程。你可以随时关闭此选项。

source: AI Assistant
zh_hans: AI 助手

source: New conversation
zh_hans: 新建对话

source: AI settings
zh_hans: AI 设置

source: Edit photos through conversation
zh_hans: 通过对话完成修图

source: Connect Codex, sign in, and describe the change. Edits run through the editor and can be undone.
zh_hans: 连接 Codex、登录账号，然后描述你的修改要求。所有修图操作通过编辑器执行，可以撤销。

source: Connect Codex
zh_hans: 连接 Codex

source: Make the photo clearer without harsh skin texture.
zh_hans: 让照片更通透，但不要让肤质显得生硬。

source: Give it a warm cinematic look.
zh_hans: 调成温暖的电影感。

source: Undo the last edit.
zh_hans: 撤销上一次修改。

source: Share canvas preview
zh_hans: 共享画布预览

source: Confirm each image edit
zh_hans: 每次修改图片前确认

source: Approve this edit?
zh_hans: 允许这次修改吗？

source: Decline
zh_hans: 拒绝

source: Apply edit
zh_hans: 应用修改

source: Answer
zh_hans: 回答

source: Choose an answer
zh_hans: 选择答案

source: Submit answers
zh_hans: 提交回答

source: Codex connection
zh_hans: Codex 连接

source: Reconnect
zh_hans: 重新连接

source: Connect
zh_hans: 连接

source: Disconnect
zh_hans: 断开连接

source: Sign out
zh_hans: 退出登录

source: Sign in with ChatGPT
zh_hans: 使用 ChatGPT 登录

source: Cancel sign-in
zh_hans: 取消登录

source: Use an API key
zh_hans: 使用 API 密钥

source: API key
zh_hans: API 密钥

source: Sign in
zh_hans: 登录

source: Model
zh_hans: 模型

source: Model (automatic when empty)
zh_hans: 模型（留空自动选择）

source: The model list is a catalog, not a guarantee of account access. Authentication is managed by Codex in a separate local home.
zh_hans: 模型目录不代表账号一定有使用权限。登录凭据由 Codex 在独立的本地目录中管理。

source: Read document
zh_hans: 读取文档

source: Inspect canvas
zh_hans: 查看画布

source: Camera Raw adjustment
zh_hans: Camera Raw 调整

source: Undo
zh_hans: 撤销

source: Redo
zh_hans: 重做

source: You
zh_hans: 你

source: Processing summary
zh_hans: 处理摘要

source: Parameters
zh_hans: 参数

source: Result
zh_hans: 结果

source: running
zh_hans: 执行中

source: completed
zh_hans: 已完成

source: failed
zh_hans: 失败

source: denied
zh_hans: 已拒绝

source: interrupted
zh_hans: 已停止

source: Codex path (automatic when empty)
zh_hans: Codex 路径（留空自动查找）

source: Choose Codex executable…
zh_hans: 选择 Codex 可执行文件…

source: Choose the installed Codex executable.
zh_hans: 请选择已安装的 Codex 可执行文件。

source: Changes take effect on reconnect. No terminal session is needed while using the editor.
zh_hans: 重新连接后应用路径更改。使用编辑器时无需另开终端。

source: General
zh_hans: 通用

source: Use the AI sidebar settings to connect, sign in, and choose a model.
zh_hans: 请在 AI 侧栏设置中连接、登录并选择模型。

source: Use the Codex-enabled build to launch the local agent. The standard build keeps Apple's App Sandbox enabled.
zh_hans: 请使用 Compositor-Codex 构建启动本地 Agent。标准构建保留了 Apple 应用沙盒，不能直接启动外部 Codex。

source: Codex is still connecting.
zh_hans: Codex 正在连接。

source: Codex executable not found. Set its path in AI settings.
zh_hans: 找不到 Codex 可执行文件。请在 AI 设置中指定其路径。

source: Codex returned an unexpected sign-in address.
zh_hans: Codex 返回了非预期的登录地址，已阻止打开。

source: Codex did not return a sign-in address.
zh_hans: Codex 没有返回登录地址。

source: Could not open the sign-in browser.
zh_hans: 无法打开登录浏览器。

source: Enter an API key.
zh_hans: 请输入 API 密钥。

source: Sign in to Codex before sending a message.
zh_hans: 请先登录 Codex，再发送消息。

source: Codex did not return a thread ID.
zh_hans: Codex 没有返回会话 ID。

source: Codex did not return a turn ID.
zh_hans: Codex 没有返回轮次 ID。

source: Non-editor execution was blocked.
zh_hans: 已阻止编辑器之外的执行操作。

source: Sign-in failed.
zh_hans: 登录失败。

source: Codex attempted a non-editor action. The turn was interrupted.
zh_hans: Codex 尝试执行非编辑器操作，本轮已停止。

source: Codex reported an error.
zh_hans: Codex 返回了错误。

source: The Codex turn failed.
zh_hans: 本轮 Codex 执行失败。

source: Edit declined.
zh_hans: 已拒绝修改。

source: No matching document for this tool call.
zh_hans: 此工具调用没有匹配的文档。

source: Conflicting duplicate tool call.
zh_hans: 检测到参数冲突的重复工具调用。

source: Tool-call limit reached. Start a new turn.
zh_hans: 已达到本轮工具调用上限，请开始新一轮。

source: Unsupported editor tool or arguments.
zh_hans: 不支持的编辑工具或参数。

source: Camera Raw requires a layer ID and supported numeric parameters.
zh_hans: Camera Raw 需要图层 ID 和支持的数值参数。

source: This editor tool does not accept arguments.
zh_hans: 此编辑工具不接受参数。

source: The document changed. Start a new turn for the current document.
zh_hans: 文档已更换，请针对当前文档开始新一轮对话。

source: Finish the current editor operation before running an AI tool.
zh_hans: 请先完成当前编辑操作，再运行 AI 工具。

source: Canvas sharing is off. Ask the user to enable it.
zh_hans: 画布共享已关闭，请先启用共享。

source: This canvas is too large for an AI preview. Use a smaller canvas.
zh_hans: 此画布过大，无法生成 AI 预览，请使用较小的画布。

source: Could not create a canvas preview.
zh_hans: 无法生成画布预览。

source: The editor is not ready for an AI edit.
zh_hans: 编辑器当前无法执行 AI 修改。

source: The active layer changed. Read document info again before editing.
zh_hans: 当前图层已更换，请重新读取文档信息后再修改。

source: Camera Raw did not commit. Check or cancel the editor's filter dialog.
zh_hans: Camera Raw 未提交，请检查或取消编辑器中的滤镜对话框。

source: Camera Raw adjustment applied. The edit can be undone in Compositor.
zh_hans: 已应用 Camera Raw 调整，可在 Compositor 中撤销。

source: Nothing to undo.
zh_hans: 没有可以撤销的操作。

source: Nothing to redo.
zh_hans: 没有可以重做的操作。

source: Undo complete.
zh_hans: 已撤销。

source: Redo complete.
zh_hans: 已重做。

source: Canvas preview sent (1024px maximum).
zh_hans: 已发送画布预览（最长边 1024 像素）。

source: Codex frame is too large.
zh_hans: Codex 消息帧过大。

source: Invalid Codex RPC envelope.
zh_hans: Codex RPC 消息格式无效。

source: Codex disconnected during a JSON frame.
zh_hans: Codex 在消息传输完成前断开了连接。

source: Codex disconnected. Reconnect to continue.
zh_hans: Codex 已断开，请重新连接后继续。

source: Codex is not connected.
zh_hans: Codex 尚未连接。

source: Codex RPC failed.
zh_hans: Codex RPC 请求失败。

source: Codex disconnected.
zh_hans: Codex 已断开。

source: Conversation is too large to save locally.
zh_hans: 对话过大，无法继续保存到本地。

source: Model profiles
zh_hans: 模型配置

source: Done
zh_hans: 完成

source: Profile
zh_hans: 配置

source: Service
zh_hans: 服务

source: Add service
zh_hans: 添加服务

source: New custom service
zh_hans: 新建自定义服务

source: Custom service
zh_hans: 自定义服务

source: Save and use
zh_hans: 保存并使用

source: Remove profile
zh_hans: 删除配置

source: Remove
zh_hans: 删除

source: Profile name
zh_hans: 配置名称

source: Base URL (include a port for local services)
zh_hans: 服务地址（本地服务可包含端口）

source: API key (leave blank to keep the saved key)
zh_hans: API Key（留空保留已存密钥）

source: Model ID
zh_hans: 模型 ID

source: Choose model
zh_hans: 选择模型

source: Test connection / load models
zh_hans: 测试连接 / 获取模型

source: DeepSeek preset
zh_hans: DeepSeek 预设

source: DeepSeek V4.1 Flash uses deepseek-flash and supports image input.
zh_hans: DeepSeek V4.1 Flash 的模型 ID 为 deepseek-flash，支持图片输入。

source: This model supports image input
zh_hans: 此模型支持图片输入

source: Requires the Responses API with function calling. Chat Completions-only services are not compatible. Model-list checks do not run inference.
zh_hans: 需要支持 Responses API 和工具调用；仅支持 Chat Completions 的服务不兼容。获取模型列表不会调用模型推理。

source: API keys stay in macOS Keychain. They are not written to the project, CLI config, or chat history.
zh_hans: API Key 保存在 macOS 钥匙串中，不写入项目、CLI 配置或聊天记录。

source: Switching services keeps separate histories and turns canvas sharing off. It does not transfer old chats or photos.
zh_hans: 切换服务会使用独立会话并关闭画布共享，不会转发旧聊天或图片。

source: Remove this profile and its API key?
zh_hans: 删除此配置及其 API Key？

source: Local conversation files are kept. This does not delete anything from the model service.
zh_hans: 本地会话文件会保留，不会删除模型服务中的任何内容。

source: ChatGPT / Codex uses the existing browser or OpenAI API-key sign-in. Your usual CLI configuration is unchanged.
zh_hans: ChatGPT / Codex 继续使用现有的浏览器登录或 OpenAI API Key 登录，不修改你的日常 CLI 配置。

source: Model list loaded. This verifies the catalog endpoint, not a paid inference request.
zh_hans: 已获取模型列表。这只验证列表接口，不代表付费推理请求已通过。

source: Enter a profile name (up to 80 characters).
zh_hans: 请输入配置名称，最多 80 个字符。

source: Enter a model ID without spaces.
zh_hans: 请输入不含空白字符的模型 ID。

source: Enter a base URL without credentials, query parameters, or fragments.
zh_hans: 请输入服务基础地址，不要在地址中包含密钥、查询参数或片段标识。

source: Use HTTPS for remote services. HTTP is allowed only for localhost.
zh_hans: 远程服务请使用 HTTPS。只有本地回环地址允许使用 HTTP。

source: This integration requires a Responses API endpoint, not Chat Completions or Messages.
zh_hans: 此接入需要 Responses API，不是 Chat Completions 或 Messages 接口。

source: Invalid service address.
zh_hans: 服务地址无效。

source: Could not read the API key from macOS Keychain.
zh_hans: 无法从 macOS 钥匙串读取 API Key。

source: Enter an API key without control characters.
zh_hans: API Key 不能包含控制字符或内嵌换行。

source: Could not save the API key in macOS Keychain.
zh_hans: 无法将 API Key 保存到 macOS 钥匙串。

source: Could not remove the API key from macOS Keychain.
zh_hans: 无法从 macOS 钥匙串删除 API Key。

source: Enter an API key. Changing the service address requires a new key.
zh_hans: 请输入 API Key。修改服务地址后需要重新填写密钥。

source: Invalid model-list response.
zh_hans: 模型列表响应格式无效。

source: The service rejected the API key or account permissions.
zh_hans: 服务拒绝了 API Key，或账号没有相应权限。

source: This service has no model-list endpoint. Enter the model ID manually; Responses API support is still required.
zh_hans: 该服务未提供模型列表接口。可以手动填写模型 ID，但服务仍须支持 Responses API。

source: The model-list response is too large.
zh_hans: 模型列表响应过大。

source: The service returned no models. Enter a model ID manually.
zh_hans: 服务未返回模型，请手动填写模型 ID。

source: Add this service's API key in Model profiles.
zh_hans: 请在“模型配置”中填写该服务的 API Key。

source: Use Model profiles to set this service's API key.
zh_hans: 请通过“模型配置”设置该服务的 API Key。

source: Could not prepare the Codex connection.
zh_hans: 无法准备 Codex 通信连接。

source: Edit service and model…
zh_hans: 编辑服务和模型…

source: Connected means the local Codex process is ready. Test the API key in Model profiles.
zh_hans: “已连接”表示本地 Codex 进程就绪。API Key 可在“模型配置”中测试。

source: Image input is disabled for this model.
zh_hans: 此模型未启用图片输入。

source: Choose a service, connect, and describe the change. Configure DeepSeek or another provider in Model profiles. Edits can be undone.
zh_hans: 选择服务并连接，然后描述修改要求。DeepSeek 或其他服务可在“模型配置”中设置，修图操作可以撤销。

source: Appearance
zh_hans: 外观主题

source: Follow System
zh_hans: 跟随系统

source: Light appearance
zh_hans: 浅色

source: Dark appearance
zh_hans: 深色

source: AI service
zh_hans: AI 服务
